package main

import  (

)


// Реализовать точку доступа GET /api/items, которая возвращает список элементов предметной области. 

// Реализовать точку доступа GET /api/items/{id}, которая возвращает один элемент по идентификатору, 
// либо согласованный ответ об ошибке, если элемент не найден. 

// Реализовать точку доступа POST /api/items, которая создаёт новый элемент, либо возвращает согласованный ответ 
// об ошибке при некорректных данных. 

// Реализовать хранение данных в памяти процесса, без базы данных. 

// Реализовать проверку входных данных минимум по двум правилам, например непустое имя и 
// неотрицательное число в цене. 

// Реализовать единый формат ошибок в ответах, в котором обязательно присутствуют код ошибки, 
// сообщение и идентификатор запроса. 